# DividedSurfaceDisplayNodes Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedSurfaceDisplayNodes Property
ParameterTypeId Class See Also
---
"Nodes"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedSurfaceDisplayNodes { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceDisplayNodes As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedSurfaceDisplayNodes {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace